<a href="https://colab.research.google.com/github/neilkazimierzsheridan/data_science_course/blob/main/ds_Pandas_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas: Combining Data

In [1]:
import numpy as np
import pandas as pd

# Concatenation

Combining data with concatenation through pd.concat()

In [3]:
#pasting two dataframes together by columns or rows. Need to be same format of course
#pandas autofill NaN when needed

#lets make some dataframes

data_one = {'A': ['A0','A1','A2', 'A3'], 'B': ['B0','B1', 'B2', 'B3']}
data_two = {'C': ['C0','C1','C2', 'C3'], 'D': ['D0','D1', 'D2', 'D3']}
data_one

{'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [5]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [6]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [7]:
#same format so stick them together
pd.concat([one, two], axis=1) #axis=1 so along the columns

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [8]:
pd.concat([one,two],axis=0) #along the rows

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [10]:
#let's bring C D to the first two columns, it's teh same feature
two.columns = one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [11]:
pd.concat([one,two], axis=0) #here we go, see the index is duplicated

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [14]:
#Let's change the index
mydf = pd.concat([one,two], axis=0)
mydf.index = range(len(mydf))
mydf #yup!

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

# Inner Merge

In [4]:
#dataframes may not be in same order or format, so we can't concatenate
#them. Here we merge them. Analogous to JOIN in SQL

#merge() key argument HOW?
# 1. Inner
# 2. Outer
# 3. Left/Right

#merge ON has to be a unqiue ID

registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [5]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [6]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [18]:
#The unique ID is going to be name, so we merge ON this!
pd.merge(registrations, logins, how='inner', on='name') 
#how = inner on = name
#one Andrew and Bobo in both tables so got merged

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

# Left and Right Merge

In [20]:
#order of the tables being passed in DOES MATTER now!

# how = left to begin with. Registrations is the left table, logins is the right
# this means we get everything in name from the left table, regardless of
# if they are in the right table. So we might end up with some NaN!

pd.merge(registrations, logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [21]:
#Now for right! So we get everything in name from right, regardless if present in
#the left table!

pd.merge(registrations, logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

# Outer Merge

In [7]:
#allows us to include everything in both tables w NaN
pd.merge(registrations, logins, how='outer', on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

Joining on an index instead of a column

In [8]:
registrations = registrations.set_index('name')
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [9]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [10]:
#join on registration index, and login name column
pd.merge(registrations, logins, left_index=True, right_on='name', how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [12]:
registrations = registrations.reset_index()
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [14]:
registrations.columns = ['reg_name', 'reg_id']
registrations #changing of column names

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [15]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [17]:
results = pd.merge(registrations,logins,how='inner', left_on='reg_name', right_on='name')

In [18]:
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [19]:
results.drop('reg_name', axis=1) #goodbye reg_name

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [21]:
registrations.columns = ['name', 'id']
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [22]:
logins.columns = ['id','name']
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [23]:
#so what are we to do with two tables having the same column names!! 
pd.merge(registrations, logins, how='inner', on='name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [24]:
#Pandas gives a suffix x for left table, and y for right table!
#or you can choose your own suffix e.g. the name of tables
pd.merge(registrations, logins, how='inner', on='name', suffixes=('_reg', '_log'))

#so that's nice and easy to stop any mix ups!

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4